2m3_4mm_wall_H2_test_73/constant/reactions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       IOobject;
    location    "constant";
    object      reactions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

species
(
    H2O
    O2
    N2
    H2
);
reactions
{
    H2Reaction
    {
        type     irreversibleArrheniusReaction;
        reaction "H2 + 0.5O2 = H2O ";  //a place holder, no reaction is activated
        A        5.2e16;
        beta     0;
        Ta       14906;
    }
}

// ************************************************************************* //
